app/views/orders/_form.html.erb

    <div class="col-sm-10">
      <%= f.select :client_id, User.all.map { |p| [p.name, p.id] }, {:include_blank => '-' }, class: "form-control" %>
---
SELECT "users".* FROM "users"

    <div class="col-sm-10">
      <%= f.select :table_id, Table.all.map { |p| [p.name, p.id] }, {:include_blank => '-' }, class: "form-control" %>
---
SELECT "tables".* FROM "tables"