app/views/orders/show.html.erb

    <tbody>
      <%= content_tag_for(:tr, @order.order_lines) do |order_line| %>
---
SELECT "order_lines".* FROM "order_lines" WHERE "order_lines"."order_id" = $1  [["order_id", 1]]