app/views/sub_categories/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="col-sm-10">
      <%= f.select :category_id, Category.all.map { |p| [p.name, p.id] }, {:include_blank => '-' }, class: "form-control" %>