app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "order", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Drinks"], ["order", 4], ["created_at", "2015-08-22 18:04:15.103860"], ["updated_at", "2015-08-22 18:04:15.103860"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save