app/controllers/orders_controller.rb

INSERT INTO "orders" ("client_id", "waiter_id", "table_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["client_id", 2], ["waiter_id", 2], ["table_id", 1], ["status", "Draft"], ["created_at", "2015-08-24 11:38:12.333647"], ["updated_at", "2015-08-24 11:38:12.333647"]]
---
  def create
    @order = Order.new(order_params)
    @order.session_cookie = get_unregistered_cookie

    respond_to do |format|
      if @order.save