app/controllers/order_lines_controller.rb

  def index
    @order_lines = OrderLine.all
---
SELECT "order_lines".* FROM "order_lines"

  def create
    @order_line = OrderLine.new(order_line_params)

    respond_to do |format|
      if @order_line.save
---
INSERT INTO "order_lines" ("order_id", "product_id", "quantity", "value", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["order_id", 1], ["product_id", 2], ["quantity", "12.0"], ["value", "14.24"], ["status", "Submitted"], ["created_at", "2015-08-24 11:43:11.643042"], ["updated_at", "2015-08-24 11:43:11.643042"]]

  def update
    respond_to do |format|
      if @order_line.update(order_line_params)
---
UPDATE "order_lines" SET "status" = $1, "updated_at" = $2 WHERE "order_lines"."id" = $3  [["status", "Submitted"], ["updated_at", "2015-08-24 12:53:30.249465"], ["id", 1]]
UPDATE "orders" SET "total" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["total", "14.24"], ["updated_at", "2015-08-24 16:17:44.215560"], ["id", 1]]

  def deliver
      order_line = OrderLine.find(params[:id])
      order_line.status = OrderLine.status_delivered
      respond_to do |format|
        if order_line.save
---
SELECT  "order_lines".* FROM "order_lines" WHERE "order_lines"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "order_lines" SET "status" = $1, "updated_at" = $2 WHERE "order_lines"."id" = $3  [["status", "Delivered"], ["updated_at", "2015-08-24 12:52:11.843678"], ["id", 1]]

  def process_line
      order_line = OrderLine.find(params[:id])
      order_line.status = OrderLine.status_processing
      respond_to do |format|
        if order_line.save
---
SELECT  "order_lines".* FROM "order_lines" WHERE "order_lines"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "order_lines" SET "status" = $1, "updated_at" = $2 WHERE "order_lines"."id" = $3  [["status", "Processing"], ["updated_at", "2015-08-24 15:38:43.347579"], ["id", 1]]

  def cancel
      order_line = OrderLine.find(params[:id])
      order_line.status = OrderLine.status_canceled
      respond_to do |format|
        if order_line.save
---
SELECT  "order_lines".* FROM "order_lines" WHERE "order_lines"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "order_lines" SET "status" = $1, "updated_at" = $2 WHERE "order_lines"."id" = $3  [["status", "Canceled"], ["updated_at", "2015-08-24 15:35:52.592933"], ["id", 2]]

    def set_order_line
      @order_line = OrderLine.find(params[:id])
---
SELECT  "order_lines".* FROM "order_lines" WHERE "order_lines"."id" = $1 LIMIT 1  [["id", 1]]