app/controllers/products_controller.rb

INSERT INTO "products" ("name", "short_name", "description", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Hot Dog"], ["short_name", "Hot Dog"], ["description", ""], ["category_id", 2], ["created_at", "2015-08-23 08:42:21.247508"], ["updated_at", "2015-08-23 08:42:21.247508"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["description", "O Bitoque é um prato típico da culinária de Portugal. Temperado com mostarda ou molho picante."], ["updated_at", "2015-08-24 09:02:42.829816"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)