app/controllers/sub_categories_controller.rb

SELECT "sub_categories".* FROM "sub_categories"
---
  def index
    @sub_categories = SubCategory.all

INSERT INTO "sub_categories" ("name", "category_id", "order", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Fruit"], ["category_id", 3], ["order", 1], ["created_at", "2015-08-22 17:51:13.060651"], ["updated_at", "2015-08-22 17:51:13.060651"]]
---
  def create
    @sub_category = SubCategory.new(sub_category_params)

    respond_to do |format|
      if @sub_category.save

SELECT  "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_sub_category
      @sub_category = SubCategory.find(params[:id])