app/controllers/tables_controller.rb

SELECT "tables".* FROM "tables"
---
  def index
    @tables = Table.all

INSERT INTO "tables" ("name", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "1"], ["token", "asdasdqew123"], ["created_at", "2015-08-24 11:37:46.669090"], ["updated_at", "2015-08-24 11:37:46.669090"]]
---
  def create
    @table = Table.new(table_params)

    respond_to do |format|
      if @table.save

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_table
      @table = Table.find(params[:id])