app/controllers/users_controller.rb

  def create
    @user = User.new(user_params_create)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "phone", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"