app/views/order_lines/_form.html.erb

SELECT "orders".* FROM "orders"
---
    <div class="col-sm-10">
      <%= f.select :order_id, Order.all.map { |p| [p.id, p.id] }, {:include_blank => '-' }, class: "form-control" %>

SELECT "products".* FROM "products"
---
    <div class="col-sm-10">
      <%= f.select :product_id, Product.all.map { |p| [p.name, p.id] }, {:include_blank => '-' }, class: "form-control" %>