app/views/order_lines/index.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
---
      <%= content_tag_for(:tr, @order_lines) do |order_line| %>
            <td><%= link_to order_line.order_id, order_line.order %></td>