app/views/order_lines/pending.json.jbuilder

SELECT "orders".* FROM "orders" WHERE "orders"."id" IN (1)
SELECT "tables".* FROM "tables" WHERE "tables"."id" IN (1)
---
  json.table do
  	json.extract! order_line.order.table, :id, :name