app/views/products/_form.html.erb

SELECT "sub_categories".* FROM "sub_categories"
---
    <div class="col-sm-10">
      <%= f.select :category_id, Category.all.map { |p| [p.name, p.id] }, {:include_blank => '-' }, class: "form-control" %>