app/views/reviews/_form.html.erb

SELECT "orders".* FROM "orders"
---
    <div class="col-sm-10">
      <%= f.select :order_id, Order.all.map { |p| [p.id, p.id] }, {:include_blank => '-' }, class: "form-control" %>

SELECT "users".* FROM "users"
---
    <div class="col-sm-10">
      <%= f.select :user_id, User.all.map { |p| [p.name, p.id] }, {:include_blank => '-' }, class: "form-control" %>